codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512eff100.h
#define _CNCONF_SIDL_POSITION                    0x0000000D
#define _CNCONF_SIDL_MASK                        0x00002000
#define _CNCONF_SIDL_LENGTH                      0x00000001

#define _CNCONF_ON_POSITION                      0x0000000F
#define _CNCONF_ON_MASK                          0x00008000
#define _CNCONF_ON_LENGTH                        0x00000001

#define _CNCONF_w_POSITION                       0x00000000
#define _CNCONF_w_MASK                           0xFFFFFFFF
#define _CNCONF_w_LENGTH                         0x00000020

#define _CNENF_CNIEF0_POSITION                   0x00000000
#define _CNENF_CNIEF0_MASK                       0x00000001
#define _CNENF_CNIEF0_LENGTH                     0x00000001

#define _CNENF_CNIEF1_POSITION                   0x00000001
#define _CNENF_CNIEF1_MASK                       0x00000002
#define _CNENF_CNIEF1_LENGTH                     0x00000001

#define _CNENF_CNIEF2_POSITION                   0x00000002
#define _CNENF_CNIEF2_MASK                       0x00000004
#define _CNENF_CNIEF2_LENGTH                     0x00000001

#define _CNENF_CNIEF3_POSITION                   0x00000003
#define _CNENF_CNIEF3_MASK                       0x00000008
#define _CNENF_CNIEF3_LENGTH                     0x00000001

#define _CNENF_CNIEF4_POSITION                   0x00000004
#define _CNENF_CNIEF4_MASK                       0x00000010
#define _CNENF_CNIEF4_LENGTH                     0x00000001

#define _CNENF_CNIEF5_POSITION                   0x00000005
#define _CNENF_CNIEF5_MASK                       0x00000020
#define _CNENF_CNIEF5_LENGTH                     0x00000001

#define _CNENF_CNIEF8_POSITION                   0x00000008
#define _CNENF_CNIEF8_MASK                       0x00000100
#define _CNENF_CNIEF8_LENGTH                     0x00000001

#define _CNENF_CNIEF12_POSITION                  0x0000000C
#define _CNENF_CNIEF12_MASK                      0x00001000
#define _CNENF_CNIEF12_LENGTH                    0x00000001

#define _CNENF_CNIEF13_POSITION                  0x0000000D
#define _CNENF_CNIEF13_MASK                      0x00002000
#define _CNENF_CNIEF13_LENGTH                    0x00000001

#define _CNENF_w_POSITION                        0x00000000
#define _CNENF_w_MASK                            0xFFFFFFFF
#define _CNENF_w_LENGTH                          0x00000020

#define _CNSTATF_CNSTATF0_POSITION               0x00000000
#define _CNSTATF_CNSTATF0_MASK                   0x00000001
#define _CNSTATF_CNSTATF0_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF1_POSITION               0x00000001
#define _CNSTATF_CNSTATF1_MASK                   0x00000002
#define _CNSTATF_CNSTATF1_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF2_POSITION               0x00000002
#define _CNSTATF_CNSTATF2_MASK                   0x00000004
#define _CNSTATF_CNSTATF2_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF3_POSITION               0x00000003
#define _CNSTATF_CNSTATF3_MASK                   0x00000008
#define _CNSTATF_CNSTATF3_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF4_POSITION               0x00000004
#define _CNSTATF_CNSTATF4_MASK                   0x00000010
#define _CNSTATF_CNSTATF4_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF5_POSITION               0x00000005
#define _CNSTATF_CNSTATF5_MASK                   0x00000020
#define _CNSTATF_CNSTATF5_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF8_POSITION               0x00000008
#define _CNSTATF_CNSTATF8_MASK                   0x00000100
#define _CNSTATF_CNSTATF8_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF12_POSITION              0x0000000C
#define _CNSTATF_CNSTATF12_MASK                  0x00001000
#define _CNSTATF_CNSTATF12_LENGTH                0x00000001

#define _CNSTATF_CNSTATF13_POSITION              0x0000000D
#define _CNSTATF_CNSTATF13_MASK                  0x00002000
#define _CNSTATF_CNSTATF13_LENGTH                0x00000001

#define _CNSTATF_w_POSITION                      0x00000000
#define _CNSTATF_w_MASK                          0xFFFFFFFF
#define _CNSTATF_w_LENGTH                        0x00000020

#define _CNNEF_CNNEF0_POSITION                   0x00000000
#define _CNNEF_CNNEF0_MASK                       0x00000001
#define _CNNEF_CNNEF0_LENGTH                     0x00000001

#define _CNNEF_CNNEF1_POSITION                   0x00000001
#define _CNNEF_CNNEF1_MASK                       0x00000002
#define _CNNEF_CNNEF1_LENGTH                     0x00000001

#define _CNNEF_CNNEF2_POSITION                   0x00000002
#define _CNNEF_CNNEF2_MASK                       0x00000004
#define _CNNEF_CNNEF2_LENGTH                     0x00000001

#define _CNNEF_CNNEF3_POSITION                   0x00000003
#define _CNNEF_CNNEF3_MASK                       0x00000008
#define _CNNEF_CNNEF3_LENGTH                     0x00000001

#define _CNNEF_CNNEF4_POSITION                   0x00000004
#define _CNNEF_CNNEF4_MASK                       0x00000010
#define _CNNEF_CNNEF4_LENGTH                     0x00000001

#define _CNNEF_CNNEF5_POSITION                   0x00000005
#define _CNNEF_CNNEF5_MASK                       0x00000020
#define _CNNEF_CNNEF5_LENGTH                     0x00000001

#define _CNNEF_CNNEF8_POSITION                   0x00000008
#define _CNNEF_CNNEF8_MASK                       0x00000100
#define _CNNEF_CNNEF8_LENGTH                     0x00000001

#define _CNNEF_CNNEF12_POSITION                  0x0000000C
#define _CNNEF_CNNEF12_MASK                      0x00001000
#define _CNNEF_CNNEF12_LENGTH                    0x00000001

#define _CNNEF_CNNEF13_POSITION                  0x0000000D
#define _CNNEF_CNNEF13_MASK                      0x00002000
#define _CNNEF_CNNEF13_LENGTH                    0x00000001

#define _CNFF_CNFF0_POSITION                     0x00000000
#define _CNFF_CNFF0_MASK                         0x00000001
#define _CNFF_CNFF0_LENGTH                       0x00000001

#define _CNFF_CNFF1_POSITION                     0x00000001
#define _CNFF_CNFF1_MASK                         0x00000002
#define _CNFF_CNFF1_LENGTH                       0x00000001

